tsung-config.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/user/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">
    <clients>
        <client host="localhost" cpu="1" use_controller_vm="true" maxusers="10000"/>
    </clients>

    <servers>
        <server host="0.0.0.0" port="4000" type="tcp"/>
    </servers>

    <load>
        <arrivalphase phase="1" duration="100" unit="second">
            <users maxnumber="1000" arrivalrate="10" unit="second"/>
        </arrivalphase>
    </load>

    <options>
        <option name="ports_range" min="1025" max="65535"/>
        <option name="connect_timeout" value="1000"/>
    </options>

    <sessions>
        <session name="websocket" probability="100" type="ts_websocket">
            <request>
                <websocket type="connect" path="/socket/websocket"></websocket>
            </request>

            <request subst="true">
                <websocket type="message">{"topic":"room:lobby","event":"phx_join","payload":{},"ref":"1"}</websocket>
            </request>

            <for var="i" from="1" to="1000" incr="1">
                <thinktime min="1" max="10" random="true"></thinktime>

                <request subst="true">
                    <websocket type="message">
                        {"topic":"room:lobby","ref":null,"payload":{"body":"text"},"event":"new_msg"}
                    </websocket>
                </request>
            </for>
        </session>
    </sessions>
</tsung>